<template>
  <div class='about'>
    <div>
      <p>
        ご覧いただきありがとうございます。このサービスは
        <a href="https://twitter.com/ms2sato" target="_blank">ms2sato</a>
        の過去体験を再現したいが為に作成している公開分報用のITエンジニア向けWEBサービスです。
        ここではこのサービスを作成している動機とか経緯みたいなものを書いています。昔話や不満なので実用的な情報はありませんのでご承知ください。
      <p>

      <p>
        少し昔話をします。10年程前Google App Engine（以下AppEngine）が発表された頃、
        Twitter上で夜な夜なAppEngineの使い方を様々な開発者が試行錯誤していたクラスタがありました
        （当時のAppEngineは適切に使うには難解な「整っていない環境」だったので、様々な知見を導入して克服しようとしていました。
        その不便さはあれど、スケールを無限にさせることのできる可能性のある「理想的なSaaSの一つの形を目指したもの」だと私は今も思っています）。
      </p>

      <p>
        私は積極的にこのクラスタに混じっていたわけではありませんが、何人もの方がAppEngineを試行錯誤しており、
        その知見を共有したり新たなチャレンジをされていたことを励みに自身もAppEngineのコードを書いていた時期があります。<br>
        なんとなく「彼らは熱中してコード書いてる。私もそんな風にいたい」そう思っていたのかもしれません。
      </p>

      <p>
        ただ、最近ではTwitterはそういった用途で使うのは憚られるようになり、Slack上の分報に取って代わられ、クローズドになった様子に感じられます。
        また、Markdownが広く受け入れられるなど時代が変わり、技術情報の共有はより進んだ形に進歩したのではないでしょうか。
        Qiitaなどのサイトもありますが、どうしても「まとまった情報を、そして可能なら正しい情報を」発信しなければならないような傾向を感じます。
      </p>

      <p>
        しかし、私が求めるのはもっと現在進行形で生々しい姿です。試行錯誤していても良いし、間違っていても良いから今の情報が共有されることを願っています。
        私は改めてオープンに技術情報が気軽に共有される場所を求めています。そういう動機からこのサービスを開発しています。
        つまり、自分のエゴを満たすためのサービスでしかありません。ですが、同じような人が世の中にはいるのではないかとも強く感じます。
      </p>

      <p>
        ちなみにこのサービスは初めてgolangやvue-cliを学びつつ、奇しくも原体験たるAppEngine を利用して作成しています。
        もし知見のある方からアドバイスいただけたら嬉しいです。
        <a href="https://github.com/CircleAround/xpo" target="_blank">こちら</a>
        でソースコードも公開しています（今の所煮るなり焼くなり好きにしろライセンスですが、どこかで何か決めます）。
      </p>

      <p>
        最後に、このサービスはまだ実験中です。まだまだ安定する予定も先になりますし、データの保証もできません。
        もしもそれでも私と一緒に試してみたいと思う方がいらっしゃったら是非ログインしてみてください。
        ご意見ご要望不満など一切は<a href="https://twitter.com/ms2sato" target="_blank">ms2sato</a>までいただければ幸いです。
      </p>
      <p style="text-align:right">
        2018/10/4 佐藤 正志（<a href="https://twitter.com/ms2sato" target="_blank">ms2sato</a>）
      </p>
    </div>
  </div>
</template>
